import pandas as pd
df = pd.read_csv("quraan_text.txt", sep='|', header=None, names=['Sorah_num', 'Ayah_num', 'Ayah_text'])
def pros():

    d = """الفاتحة\t', 'البقرة\t', 'آل_عمران', 'النساء\t', 'المائدة\t', 'الأنعام', 'الأعراف\t', 'الأنفال', 'التوبة', 'يونس\t', 'هود\t', 'يوسف', 'الرعد\t', 'إبراهيم\t', 'الحجر', 'النحل\t', 'الإسراء\t', 'الكهف', 'مريم\t', 'طه', 'الأنبياء', 'الحج', 'المؤمنون\t', 'النور', 'الفرقان\t', 'الشعراء\t', 'النمل', 'القصص\t', 'العنكبوت\t', 'الروم', 'لقمان\t', 'السجدة\t', 'الأحزاب', 'سبأ\t', 'فاطر\t', 'يس', 'الصافات\t', 'ص\t', 'الزمر', 'غافر\t', 'فصلت\t', 'الشورى', 'الزخرف\t', 'الدخان\t', 'الجاثية', 'الأحقاف\t', 'محمد\t', 'الفتح', 'الحجرات\t', 'ق', 'الذاريات', 'الطور', 'النجم\t', 'القمر', 'الرحمن\t', 'الواقعة\t', 'الحديد', 'المجادلة\t', 'الحشر\t', 'الممتحنة', 'الصف\t', 'الجمعة\t', 'المنافقون', 'التغابن\t', 'الطلاق\t', 'التحريم', 'الملك\t', 'القلم\t', 'الحاقة', 'المعارج\t', 'نوح\t', 'الجن', 'المزمل\t', 'المدثر\t', 'القيامة', 'الإنسان\t', 'المرسلات\t', 'النبأ', 'النازعات\t', 'عبس\t', 'التكوير', 'الإنفطار\t', 'المطففين\t', 'الانشقاق', 'البروج\t', 'الطارق\t', 'الأعلى', 'الغاشية\t', 'الفجر\t', 'البلد', 'الشمس\t', 'الليل\t', 'الضحى', 'الشرح\t', 'التين\t', 'العلق', ' القدر\t', 'البينة\t', 'الزلزلة', 'العاديات\t', 'القارعة\t', 'التكاثر', 'العصر\t', 'الهمزة\t', 'الفيل', 'قريش\t', 'الماعون\t', 'الكوثر', 'الكافرون\t', 'النصر\t', 'المسد', 'الإخلاص\t', 'الفلق\t', 'الناس'"""
    d = d.replace("\t", '')
    d = d.replace("'","")
    d = d.replace(",", "")
    d = d.split(" ")
    nc = []
    for i in df["Sorah_num"]:
        for j in d:
            if i == (d.index(j)+1):
                nc.append(j)
    nnc =  pd.Series(nc)
    df.insert(0, 'Sorah_name', nnc)
    return df

fr = pros()

fr.to_csv("quraan.csv")
